# RbsRoutingPreferenceParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsRoutingPreferenceParam Property
ParameterTypeId Class See Also
---
"Routing Preferences"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsRoutingPreferenceParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsRoutingPreferenceParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsRoutingPreferenceParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace